---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleTargetResult
source: html/b0790115-0841-1c89-e214-02f9be115f6a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleTargetResult Property

"Target Result": Calculation Rule Target Result

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeCalcRuleTargetResult { get; }
```